# .Brewfile
#
# Uses: https://github.com/Homebrew/homebrew-bundle
# Run with: brew bundle --file=$HOME/.Brewfile
#
# Brandon Amos <http://bamos.github.io>

tap 'laurent22/massren'
brew 'massren'

tap 'mpv-player/mpv'
brew 'mpv'

tap 'homebrew/science'
brew 'r'

tap 'caskroom/cask'
brew 'brew-cask'
cask 'android-studio'
cask 'eclipse-java'
cask 'dia'
cask 'google-chrome'
cask 'firefox'
cask 'github'
cask 'insomniax'
cask 'java'
cask 'kid3'
cask 'mactex'
cask 'musicbrainz-picard'
cask 'music-manager'
cask 'radiant-player'
cask 'RStudio'
cask 'seil'
cask 'silverlight'
cask 'skim'
cask 'skype'
cask 'sublime-text'
cask 'synergy'
cask 'tikz-editor'
cask 'torbrowser'
cask 'vagrant'
cask 'xquartz'
cask 'xtrafinder'

brew 'ant'
brew 'android-ndk'
brew 'android-sdk'
brew 'aria2'
brew 'autossh'
brew 'cloc'
brew 'coreutils'
brew 'cvs'
brew 'dos2unix'
brew 'emacs', args: ['with-cocoa', 'with-gnutls']
brew 'exiftool'
brew 'fdupes'
brew 'ffmpeg'
brew 'foremost'
brew 'gcc'
brew 'homebrew/dupes/gdb'
brew 'git'
brew 'hub'
brew 'glew'
brew 'gnupg'
brew 'gnupg2'
brew 'heroku-toolbelt'
brew 'htop'
brew 'imagemagick'
#brew 'lilypond'
brew 'lua'
brew 'macvim'
brew 'markdown'
brew 'mosh'
#brew 'mutt'
brew 'ncdu'
brew 'netcat'
brew 'nmap'
brew 'npm'
brew 'pass'
brew 'pwgen'
brew 'python'
brew 'python3'
brew 'reattach-to-user-namespace'
brew 'rubber'
brew 'sbt'
brew 'scala'
brew 'sshfs'
brew 'sox'
brew 'tcpdump'
brew 'terminal-notifier'
brew 'the_silver_searcher'
brew 'timidity'
brew 'tmux'
brew 'tor'
brew 'tree'
brew 'unrar'
brew 'watch'
brew 'wget'
brew 'youtube-dl'
brew 'zsh'
